package ioanna.main.model;

import ioanna.main.model.utils.Color;

public class King extends Piece{

	
	public King(Color color, Location location) {
		super(color, location,"K");
	}
	
	
	@Override
	void moveToLocation(Location newLocation) {
		// TODO Auto-generated method stub
		
	}
	
//	Αφηρημένη κλάση που αντιπροσωπεύει ένα κομμάτι του παιχνιδιού. Κάθε κομμάτι χαρακτηρίζεται
//	από το χρώμα και τη θέση του, και επίσης περιέχει μία αναφορά προς τη σκακιέρα στην οποία ανήκει
//	(κλάση Board, βλ. παρακάτω). Κατά τη δημιουργία ενός κομματιού δίνονται τα τρία αυτά στοιχεία του.
//	Το χρώμα 
//	και η σκακιέρα του κομματιού δεν μπορούν να αλλάξουν, 
//	ενώ η θέση του (προφανώς) μπορεί
//	να αλλάξει.
//	Με βάση τα παραπάνω διαμορφώστε μεθόδους δημιουργίας και πρόσβασης στα πεδία της κλάσης
//	(μόνο όσες χρειάζονται).
//	Επίσης η κλάση δηλώνει την ακόλουθη αφηρημένη μέθοδο:
//	void moveTo(Location newLoc)
//	Υλοποιεί την κίνηση του κομματιού σε μία νέα θέση. Εφόσον η κίνηση είναι έγκυρη την πραγ-
//	ματοποιεί, αλλάζοντας τη θέση του κομματιού στη σκακιέρα, απομακρύνοντας αντίπαλο κομμάτι
//	που τυχόν υπάρχει στην τελική θέση, κ.λπ. Σε διαφορετική περίπτωση προκαλεί μία εξαίρεση του
//	τύπου InvalidMoveException (βλ. παρακάτω) με κατάλληλα χαρακτηριστικά.

	
	
	
}
